run/tutorials/heatTransfer/buoyantBoussinesqSimpleFoam/iglooWithFridges/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    igloo_region0
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    twoFridgeFreezers_seal_0
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }

    twoFridgeFreezers_herring_1
    {
        type            buoyantPressure;
        rho             rhok;
        value           uniform 0;
    }
}

// ************************************************************************* //
